# Pandas

## Introduction

[Documentation](https://pandas.pydata.org/docs/#pandas-documentation)

___Pandas is well suited for many different kinds of data:___

* Tabular data with heterogeneously-typed columns, as in an SQL table or Excel spreadsheet
* Ordered and unordered (not necessarily fixed-frequency) time series data.
* Arbitrary matrix data (homogeneously typed or heterogeneous) with row and column labels
* Any other form of observational / statistical data sets. The data actually need not be labeled at all to be placed into a pandas data structure

The two primary data structures of pandas, [Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html#pandas.Series) (1-dimensional) and [DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/frame.html) (2-dimensional), handle the vast majority of typical use cases in finance, statistics, social science, and many areas of engineering. 

___Here are just a few of the things that pandas does well:___

* Easy handling of missing data (represented as NaN) in floating point as well as non-floating point data
* Size mutability: columns can be inserted and deleted from DataFrame and higher dimensional objects
* Automatic and explicit data alignment: objects can be explicitly aligned to a set of labels, or the user can simply ignore the labels and let Series, DataFrame, etc. automatically align the data for you in computations
* Powerful, flexible group by functionality to perform split-apply-combine operations on data sets, for both aggregating and transforming data
* Make it easy to convert ragged, differently-indexed data in other Python and NumPy data structures into DataFrame objects
* Intelligent label-based slicing, fancy indexing, and subsetting of large data sets
* Intuitive merging and joining data sets
* Flexible reshaping and pivoting of data sets
* Hierarchical labeling of axes (possible to have multiple labels per tick)
* Robust IO tools for loading data from flat files (CSV and delimited), Excel files, databases, and saving / loading data from the ultrafast HDF5 format
* Time series-specific functionality: date range generation and frequency conversion, moving window statistics, date shifting and lagging.

___Mutability and copying of data___

All pandas data structures are value-mutable (the values they contain can be altered) but not always size-mutable.  
* The length of a __Series__ cannot be changed
* Columns can be inserted into a __DataFrame__. 

However, the vast majority of methods produce new objects and leave the input data untouched. In general we like to favor immutability where sensible.

## Basics

* The columns and the index are known as the axes. The index is axis 0, and the columns are axis 1.
* Pandas uses `NaN` (not a number) to represent missing values.
* By default, pandas shows 60 rows and 20 columns, but we have limited that in the book, so the data fits in a page.
* The `.head` method accepts an optional parameter, `n`, which controls the number of rows displayed. The default value for `n` is 5. Similarly, the `.tail` method returns the last `n` rows. The `.sample`method returns a random sample of items from an axis of object.


![image.png](./images/dataframe-struct.png)

### Data types

https://pandas.pydata.org/pandas-docs/stable/reference/arrays.html#datetime-data

In very broad terms, data may be classified as either __continuous__ or __categorical__. 
* Continuous data is always numeric and represents some kind of measurements, such as height, wage, or salary. Continuous data can take on an infinite number of possibilities. 
* Categorical data, on the other hand, represents discrete, finite amounts of values such as car color, type of poker hand, or brand of cereal.

The following describes common pandas data types:

* float – The NumPy float type, which supports missing values
* int – The NumPy integer type, which does not support missing values
* 'Int64' – pandas nullable integer type. __Note: This is different than `int64`__
* `object` – The NumPy type for storing strings (and mixed types). The object data type is the one data type that is unlike the others. A column that is of the object data type may contain values that are of any valid Python object. __Typically, when a column is of the object data type, it signals that the entire column is strings. When you load CSV files and string columns are missing values, pandas will stick in a NaN (float) for that cell. So the column might have both object and float (missing) values in it.__
* 'category' – pandas categorical type, which does support missing values. As pandas grew larger and more popular, the `object` data type proved to be too generic for all columns with string values. __pandas created its own categorical data type to handle columns of strings (or numbers) with a fixed number of possible values.__
* bool – The NumPy Boolean type, which does not support missing values (None becomes False, np.nan becomes True)
* 'boolean' – pandas nullable Boolean type
* datetime64[ns] – The NumPy date type, which does support missing values (NaT)

## DataFrame
https://pandas.pydata.org/docs/reference/frame.html

In [1]:
import pandas as pd
import numpy as np

In [2]:
stocks = pd.read_csv("data/stocks.csv")
print(type(stocks))
display(stocks)

print('shape = ', stocks.shape)
print('size = ', stocks.size)
print('ndim = ', stocks.ndim)
print('len = ', len(stocks))

<class 'pandas.core.frame.DataFrame'>

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

shape =  (3, 4)
size =  12
ndim =  2
len =  3

### General properties and methods

* The index and the columns represent the same thing but along different axes. They are occasionally referred to as the row index and column index.  
* If you do not specify the index, pandas will use a `RangeIndex`. A `RangeIndex` is a subclass of an `Index` that is analogous to Python's `range` object. __Its entire sequence of values is not loaded into memory until it is necessary to do so, thereby saving memory.__  
* When possible, Index objects are implemented using hash tables that allow for very fast selection and data alignment. They are ordered and can have duplicate entries.
* Beneath the `index`, `columns`, and `data` are NumPy `ndarrays`.

In [3]:
# componentes of DataFrame

columns = stocks.columns
index = stocks.index
data = stocks.to_numpy()

display(index)
display(columns)

# Beneath the index, columns, and data are NumPy ndarrays.
display(data)
display(index.to_numpy())
display(columns.to_numpy())

RangeIndex(start=0, stop=3, step=1)

Index(['Symbol', 'Shares', 'Low', 'High'], dtype='object')

array([['AAPL', 40, 135, 170],
       ['AMZN', 8, 900, 1125],
       ['TSLA', 50, 220, 400]], dtype=object)

array([0, 1, 2], dtype=int64)

array(['Symbol', 'Shares', 'Low', 'High'], dtype=object)

In [4]:
# data type of each columns
display(stocks.dtypes)

# counts of each data type
display(stocks.dtypes.value_counts())

# number of non-missing values for each column
display(stocks.count())

Symbol    object
Shares     int64
Low        int64
High       int64
dtype: object

int64     3
object    1
dtype: int64

Symbol    3
Shares    3
Low       3
High      3
dtype: int64

In [5]:
# get info on the dataframe
display(stocks.info())

# get info on the dataframe
display(stocks.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Symbol  3 non-null      object
 1   Shares  3 non-null      int64
 2   Low     3 non-null      int64
 3   High    3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

None

          Shares         Low         High
count   3.000000    3.000000     3.000000
mean   32.666667  418.333333   565.000000
std    21.939310  419.295043   498.422512
min     8.000000  135.000000   170.000000
25%    24.000000  177.500000   285.000000
50%    40.000000  220.000000   400.000000
75%    45.000000  560.000000   762.500000
max    50.000000  900.000000  1125.000000

### Accessing Rows and Columns

Selecting a single column from a DataFrame returns a Series

In [6]:
display(stocks)

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

#### Accessing columns

In [7]:
display(stocks['Low'])
display(stocks.Low)

0    135
1    900
2    220
Name: Low, dtype: int64

0    135
1    900
2    220
Name: Low, dtype: int64

We can also index off of the `.loc` and `.iloc` attributes to pull out a Series. The former allows us to pull out by column name, while the latter by position. These are referred to as _label-based_ and _positional-based_ in the pandas documentation.

`loc/iloc[row_selector, column_selector]`

In [8]:
display(stocks.loc[:, 'Low'])
display(stocks.iloc[:, 2])
display(stocks.iloc[:1, 2])

0    135
1    900
2    220
Name: Low, dtype: int64

0    135
1    900
2    220
Name: Low, dtype: int64

0    135
Name: Low, dtype: int64

#### Accessing Rows

In [9]:
display(stocks)
display(stocks.loc[0, :])
display(stocks.loc[0:1, :])

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

Symbol    AAPL
Shares      40
Low        135
High       170
Name: 0, dtype: object

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125

#### Accessing multiple columns

In [10]:
# This can also be used to order columns
display(stocks[
    [
        "High",
        "Low"
    ]
])

display(type(stocks[["High"]]))
display(type(stocks["High"]))

display(type(stocks.loc[:, ["Low"]]))
display(type(stocks.loc[:, "Low"]))

   High  Low
0   170  135
1  1125  900
2   400  220

pandas.core.frame.DataFrame

pandas.core.series.Series

pandas.core.frame.DataFrame

pandas.core.series.Series

#### Selecting and Filtering Columns by Data Types and Names

In [11]:
display(stocks)
display(stocks.select_dtypes(include=["number"]))
display(stocks.select_dtypes(exclude=[np.int64]))

# searches column names (or index labels) based on which parameter is used. 
# like parameter is used to search for all the columns or index names that contain the exact string 'AAPL'
display(stocks.filter(like='Low'))

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

   Shares  Low  High
0      40  135   170
1       8  900  1125
2      50  220   400

  Symbol
0   AAPL
1   AMZN
2   TSLA

   Low
0  135
1  900
2  220

### Ordering Columns

In [12]:
display(stocks)

order = ['Shares', 'High', 'Low']
        
display(stocks[order])

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

   Shares  High  Low
0      40   170  135
1       8  1125  900
2      50   400  220

### Renaming Columns

In [13]:
display(stocks)

column_dict = {column : column.lower() for column in stocks.columns.to_list()}
display(stocks.rename(columns=column_dict)) # not an in place change

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

  symbol  shares  low  high
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

### Setting and Renaming Index

In [14]:
display(stocks)
index_map={'AAPL': 'Apple Inc.'}

display(stocks.set_index('Symbol').rename(index=index_map))

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

            Shares  Low  High
Symbol
Apple Inc.      40  135   170
AMZN             8  900  1125
TSLA            50  220   400

### Processing data in different columns together

In [15]:
low_high_1 = stocks.Low + stocks.High
low_high_2 = stocks.loc[:, ['Low', 'High']].sum(axis="columns")

display(type(low_high_1))

display(low_high_1)
display(low_high_2)

pandas.core.series.Series

0     305
1    2025
2     620
dtype: int64

0     305
1    2025
2     620
dtype: int64

### Creating Columns
`assign` method - https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.assign.html
`insert` method - https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.insert.html

In [16]:
stocks_copy = stocks.copy(deep=False)

display(stocks_copy)

display(stocks_copy.assign(vol_gtr_45= lambda col: col.Shares > 45))
display(stocks_copy.assign(vol_gtr_45= stocks_copy.Shares > 45))

stocks_copy.insert(loc=0, column="Difference", value=stocks_copy["High"] - stocks_copy["Low"])
stocks_copy['change_percentage'] = 0
stocks_copy['average_price'] = stocks.Low + stocks.High / 2
display(stocks_copy)

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

  Symbol  Shares  Low  High  vol_gtr_45
0   AAPL      40  135   170       False
1   AMZN       8  900  1125       False
2   TSLA      50  220   400        True

  Symbol  Shares  Low  High  vol_gtr_45
0   AAPL      40  135   170       False
1   AMZN       8  900  1125       False
2   TSLA      50  220   400        True

   Difference Symbol  Shares  Low  High  change_percentage  average_price
0          35   AAPL      40  135   170                  0          220.0
1         225   AMZN       8  900  1125                  0         1462.5
2         180   TSLA      50  220   400                  0          420.0

### Chaining

In [17]:
display(stocks)
display(stocks.sum())
display(stocks.sum()[1:].sum())
display(stocks[['Shares', 'High', 'Low']].sum().sum())

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

Symbol    AAPLAMZNTSLA
Shares              98
Low               1255
High              1695
dtype: object

3048

3048

### Operations on DataFrame

In [18]:
display(stocks)

# plus operator, which attempts to add a scalar value to each value of each column of the DataFrame
display(stocks.iloc[:, 1:] + 1)

# chaining
display(stocks.iloc[:, 1:].add(1))

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

   Shares  Low  High
0      41  136   171
1       9  901  1126
2      51  221   401

   Shares  Low  High
0      41  136   171
1       9  901  1126
2      51  221   401

### Deleting Columns

In [19]:
display(stocks.drop(columns='High'))
display(stocks)

  Symbol  Shares  Low
0   AAPL      40  135
1   AMZN       8  900
2   TSLA      50  220

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

### Creating DataFrames from scratch

In [20]:
symbols = ['RIL', 'TTM']
quotes = [1324.2, 12.4]

stocks_data_frame_dict = {'symbol': symbols, 'quote': quotes}

# By default, pandas will create a RangeIndex 
df_1 = pd.DataFrame(stocks_data_frame_dict, dtype=np.float16)
display(df_1)
display(df_1.index)

# sepcify our own index
df_2 = pd.DataFrame(stocks_data_frame_dict, index=['a', 'b'])
display(df_2)
display(df_2.index)

# list of dicts
list_of_dicts = [
    {
        'symbol' : 'NSDQ',
        'quote' : 33
    },
    {
        'symbol' : 'AAPL',
        'quote' : 333.1,
        'volume': 22
    },
    {
        'symbol' : 'ZNGA',
        'quote' : None,
        'volume': 'Delisted'
    }
]

display(pd.DataFrame(list_of_dicts))

  symbol        quote
0    RIL  1324.000000
1    TTM    12.398438

RangeIndex(start=0, stop=2, step=1)

  symbol   quote
a    RIL  1324.2
b    TTM    12.4

Index(['a', 'b'], dtype='object')

  symbol  quote    volume
0   NSDQ   33.0       NaN
1   AAPL  333.1        22
2   ZNGA    NaN  Delisted

### Exporting DataFarme

DataFrames can be exported using few methods on the DataFrame that start with to_. Example: to_csv, to_clipboard, to_json.

In [21]:
display(stocks)

# write json to string buffer

from io import StringIO
fout = StringIO()

stocks.to_json(fout)
display(fout.getvalue())

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

'{"Symbol":{"0":"AAPL","1":"AMZN","2":"TSLA"},"Shares":{"0":40,"1":8,"2":50},"Low":{"0":135,"1":900,"2":220},"High":{"0":170,"1":1125,"2":400}}'

#### Exporting to type tracking formats:

Once you have your data in a format you like, you can save it in a binary format that tracks types, such as the Feather format (pandas leverages the pyarrow library to do this).

##### Feather format

Feather is a fast, lightweight, and easy-to-use binary file format for storing data frames. It has a few specific design goals:

* Lightweight, minimal API: make pushing data frames in and out of memory as simple as possible
* Language agnostic: Feather files are the same whether written by Python or R code. Other languages can read and write Feather files, too.
* High read and write performance. When possible, Feather operations should be bound by local disk performance.
* This format is meant to enable in-memory transfer of structured data between languages and optimized so that data can be used as is without internal conversion.

Look at DataFrame's `to_feather` and `pd.read_feather` method.

##### Parquet format

Whereas Feather optimizes the binary data for the in-memory structure, Parquet optimizes for the on-disk format. 

Look at DataFrame's `to_fparquet` and `pd.read_parquetr` method.

Right now there is some conversion required for pandas to load data from both Parquet and Feather. But both are quicker than CSV and persist types.

### Efficiently reading data into DataFrame

Look into pd.read_ methods

Tips:
* Read a limited number of rows/lines in a file. Example using the `nrows` param in `pd.read_csv`
* Specify a smaller `dtype` for a given column than the default which might take more space
* If there are very unique values in a column, use the `category` data type
* If you can process chunks of the data at a time and do not need all of it in memory, you can use the `chunksize` parameter

#### Data type is inferend by Pandas

> Because CSV files contain no information about type, pandas tries to infer the types of the columns. If all of the values of a column are whole numbers and none of them are missing, then it uses the int64 type. If the column is numeric but not whole numbers, or if there are missing values, it uses float64. These data types may store more information that you need. For example, if your numbers are all below 200, you could use a smaller type, like np.int16 (or np.int8 if they are all positive).

> As of pandas 0.24, there is a new type 'Int64' (note the capitalization) that supports integer types with missing numbers. You will need to specify it with the dtype parameter if you want to use this type, as pandas will convert integers that have missing numbers to float64.

> If the column turns out to be non-numeric, pandas will convert it to an object column, and treat the values as strings. String values in pandas take up a bunch of memory as each value is stored as a Python string. If we convert these to categoricals, pandas will use much less memory as it only stores the string once, rather than creating new strings (even if they repeat) for every row.

The pandas library can also read CSV files found on the internet. You can point the read_csv function to the URL directly.

#### CSV and JSONs

In [22]:
# Note the memory usage in the output

# reading the whole file
display(pd.read_csv('data/stocks.csv').info())

# reading a limited number of rows
display(pd.read_csv('data/stocks.csv', 
                    nrows=1,
                    dtype={'Low': np.int32}
                    ).info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Symbol  3 non-null      object
 1   Shares  3 non-null      int64
 2   Low     3 non-null      int64
 3   High    3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Symbol  1 non-null      object
 1   Shares  1 non-null      int64
 2   Low     1 non-null      int32
 3   High    1 non-null      int64
dtypes: int32(1), int64(2), object(1)
memory usage: 156.0+ bytes

None

#### SQL

1. Create a SQLite database to store the Beatles information

``` python
>>> import sqlite3
>>> con = sqlite3.connect("data/beat.db")
>>> with con:
...     cur = con.cursor()
...     cur.execute("""DROP TABLE Band""")
...     cur.execute(
...         """CREATE TABLE Band(id INTEGER PRIMARY KEY,
...         fname TEXT, lname TEXT, birthyear INT)"""
...     )
...     cur.execute(
...         """INSERT INTO Band VALUES(
...         0, 'Paul', 'McCartney', 1942)"""
...     )
...     cur.execute(
...         """INSERT INTO Band VALUES(
...         1, 'John', 'Lennon', 1940)"""
...     )
...     _ = con.commit()
```

2. Read the table from the database into a DataFrame. Note that if we are reading a table, we need to use a SQLAlchemy connection. SQLAlchemy is a library that abstracts databases for us:

``` python
>>> import sqlalchemy as sa
>>> engine = sa.create_engine(
...     "sqlite:///data/beat.db", echo=True
... )
>>> sa_connection = engine.connect()
>>> beat = pd.read_sql(
...     "Band", sa_connection, index_col="id"
... )
>>> beat
   fname      lname  birthyear
id                            
0   Paul  McCartney       1942
1   John     Lennon       1940
```

3. Read from the table using a SQL query. This can use a SQLite connection or a SQLAlchemy connection:
``` python
>>> sql = """SELECT fname, birthyear from Band"""
>>> fnames = pd.read_sql(sql, con)
>>> fnames
  fname  birthyear
0  Paul       1942
1  John       1940
```

The pandas library leverages the SQLAlchemy library, which can talk to most SQL databases. This lets you create DataFrames from tables, or you can run a SQL select query and create the DataFrame from the query.

#### Reading from HTML

In [23]:
url = 'https://ssltsw.forexprostools.com'

dfs = pd.read_html(url)

display(len(dfs))
display(dfs)

4

[    0   1        2         3            4   5
 0 NaN NaN  EUR/USD    1.1779  Strong Sell NaN
 1 NaN NaN  GBP/USD    1.3047  Strong Sell NaN
 2 NaN NaN  USD/JPY  105.9500   Strong Buy NaN
 3 NaN NaN  AUD/USD    0.7150  Strong Sell NaN
 4 NaN NaN  USD/CAD    1.3396   Strong Buy NaN
 5 NaN NaN  EUR/JPY  124.7900  Strong Sell NaN
 6 NaN NaN  EUR/CHF    1.0759  Strong Sell NaN,
     0   1              2          3            4   5
 0 NaN NaN           Gold  2025.9000      Neutral NaN
 1 NaN NaN         Silver    27.9150         Sell NaN
 2 NaN NaN         Copper     2.7872  Strong Sell NaN
 3 NaN NaN  Crude Oil WTI    41.3300  Strong Sell NaN
 4 NaN NaN      Brent Oil    44.4900  Strong Sell NaN
 5 NaN NaN    Natural Gas     2.2320  Strong Sell NaN
 6 NaN NaN    US Coffee C   114.8300  Strong Sell NaN,
     0   1              2         3            4   5
 0 NaN NaN  Euro Stoxx 50   3252.65   Strong Buy NaN
 1 NaN NaN        S&P 500   3329.27  Strong Sell NaN
 2 NaN NaN            DAX  12674.88   Strong Buy NaN
 3 NaN NaN       FTSE 100   6032.18   Strong Buy NaN
 4 NaN NaN      Hang Seng  24531.62   Strong Buy NaN
 5 NaN NaN  SmallCap 2000   1551.45  Strong Sell NaN
 6 NaN NaN        IBEX 35   6950.50          Buy NaN,
     0   1           2        3            4   5
 0 NaN NaN      Nestle  107.680  Strong Sell NaN
 1 NaN NaN        BASF   48.340  Strong Sell NaN
 2 NaN NaN       Bayer   55.860  Strong Sell NaN
 3 NaN NaN     Allianz  177.620   Strong Buy NaN
 4 NaN NaN      Adidas  248.700          Buy NaN
 5 NaN NaN   Lufthansa    7.976   Strong Buy NaN
 6 NaN NaN  Siemens AG  115.800  Strong Sell NaN]

## Performance Tips

### Memory Tips

In [24]:
#  list limits for NumPy integer types
display(np.iinfo(np.int32))

# get information about floating-point numbers
display(np.finfo(np.float16))

# ask a DataFrame or Series how many bytes it is using with the .memory_usage method. 
# Note that this also includes the memory requirements of the index. 
# For pandas to extract the exact amount of memory of an object data type column, the deep parameter must be set to True
display(stocks.memory_usage())
display(stocks.Low.memory_usage())
display(stocks.memory_usage(deep=True))

iinfo(min=-2147483648, max=2147483647, dtype=int32)

finfo(resolution=0.001, min=-6.55040e+04, max=6.55040e+04, dtype=float16)

Index     128
Symbol     24
Shares     24
Low        24
High       24
dtype: int64

152

Index     128
Symbol    183
Shares     24
Low        24
High       24
dtype: int64

#### Reducing memory by changing data types

In [25]:
stocks_deep_copy = stocks.copy(deep=True)

# check max values before conversion
display(stocks_deep_copy.select_dtypes(np.int64).describe())

display(stocks_deep_copy.dtypes)
display(stocks_deep_copy.memory_usage())

# convert int64 to int16
stocks_deep_copy['Low'] = stocks_deep_copy['Low'].astype(np.int16)
stocks_deep_copy['High'] = stocks_deep_copy['High'].astype(np.int16)
stocks_deep_copy['Shares'] = stocks_deep_copy['Shares'].astype(np.int16)

display(stocks_deep_copy.dtypes)
display(stocks_deep_copy.memory_usage())

          Shares         Low         High
count   3.000000    3.000000     3.000000
mean   32.666667  418.333333   565.000000
std    21.939310  419.295043   498.422512
min     8.000000  135.000000   170.000000
25%    24.000000  177.500000   285.000000
50%    40.000000  220.000000   400.000000
75%    45.000000  560.000000   762.500000
max    50.000000  900.000000  1125.000000

Symbol    object
Shares     int64
Low        int64
High       int64
dtype: object

Index     128
Symbol     24
Shares     24
Low        24
High       24
dtype: int64

Symbol    object
Shares     int16
Low        int16
High       int16
dtype: object

Index     128
Symbol     24
Shares      6
Low         6
High        6
dtype: int64

#### Convert to Categorical Data

Consider changing object data types to categorical if they have a reasonably low cardinality (number of unique values)

In [26]:
stocks_deep_copy = stocks.copy(deep=True)

display(stocks_deep_copy)

display(stocks_deep_copy.Symbol.dtype)

print('Num of unique values = ', stocks_deep_copy.select_dtypes(include=["object"]).nunique())
stocks_deep_copy['Symbol'] = stocks_deep_copy['Symbol'].astype("category")

display(stocks_deep_copy.Symbol.dtype)

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

dtype('O')

Num of unique values =  Symbol    3
dtype: int64

CategoricalDtype(categories=['AAPL', 'AMZN', 'TSLA'], ordered=False)

### Sorted and Unique Indexes are quicker

__Index lookup vs Compound Filtering__

Index lookup is much quicker


``` python
>>> %%timeit
>>> crit1 = college["CITY"] == "Miami"
>>> crit2 = college["STABBR"] == "FL"
>>> college[crit1 & crit2]
3.05 ms ± 66.4 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)
>>> %timeit college.loc['Miami, FL']
369 µs ± 130 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)
```

college2's index is not unique and not sorted. __College3's index is unique and sorted and thus has a much quicker index lookup time__:
``` python
>>> %timeit college[college['STABBR'] == 'TX']
1.75 ms ± 187 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)
>>> %timeit college2.loc['TX']
1.09 ms ± 232 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)
>>> %timeit college3.loc['TX']
304 µs ± 17.8 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)
```

## Series
https://pandas.pydata.org/docs/reference/series.html

In [27]:
# get series out of DataFrame

symbol_series = stocks.Symbol
shares_series = stocks.Shares

display(type(symbol_series))
display(symbol_series.dtype)
display(shares_series.dtype)

pandas.core.series.Series

dtype('O')

dtype('int64')

### Series with Index

In [28]:
series = pd.Series(data=stocks.High.to_numpy(), index=stocks.Symbol.to_numpy())
display(series)

display(type(series['AAPL']))
display(type(series[['AAPL']]))

AAPL     170
AMZN    1125
TSLA     400
dtype: int64

numpy.int64

pandas.core.series.Series

### Selecting data with labels

Select data based on the lexicographic (generalization of the way words are alphabetically ordered based on the alphabetical order of their component letters) order of the values in the index. __This only works if the index is sorted.__

In [29]:
display(series)
display(series.index)

# sort the index
series.sort_index()

display(series['AAPL':'AMZN'])
display(series.loc['AAPL':'AMZN'])

AAPL     170
AMZN    1125
TSLA     400
dtype: int64

Index(['AAPL', 'AMZN', 'TSLA'], dtype='object')

AAPL     170
AMZN    1125
dtype: int64

AAPL     170
AMZN    1125
dtype: int64

### Get samples from Series

In [30]:
# This function returns the first `n` rows for the object based on position
display(symbol_series.head())

# n = Number of items from axis to return
display(symbol_series.sample(n=1))

0    AAPL
1    AMZN
2    TSLA
Name: Symbol, dtype: object

2    TSLA
Name: Symbol, dtype: object

### Get stats from Series

In [31]:
display(symbol_series.value_counts())

# Return number of non-NA/null observations in the Series
print('\nCount = ', symbol_series.count())

# return a NumPy array with the unique values
print('\nUnique = ', symbol_series.unique())

# Basic summary statistics are provided with .min, .max, .mean, .median, and .std

display(shares_series.describe())

AMZN    1
AAPL    1
TSLA    1
Name: Symbol, dtype: int64

Count =  3

Unique =  ['AAPL' 'AMZN' 'TSLA']

count     3.000000
mean     32.666667
std      21.939310
min       8.000000
25%      24.000000
50%      40.000000
75%      45.000000
max      50.000000
Name: Shares, dtype: float64

### Series Operations

In [32]:
display(shares_series)

# a new Series or DataFrame is returned when using an operator
display(shares_series + 100)
display(shares_series.add(100))
display(shares_series > 100)

0    40
1     8
2    50
Name: Shares, dtype: int64

0    140
1    108
2    150
Name: Shares, dtype: int64

0    140
1    108
2    150
Name: Shares, dtype: int64

0    False
1    False
2    False
Name: Shares, dtype: bool

### Chanining

In [33]:
# The .pipe method on a Series needs to be passed a function that accepts a Series as input and can return anything

def debug_ser(series):
 print("From pipe:")
 print(series)
 return series

print("\nend result:\n", shares_series.add(100).pipe(debug_ser).astype(float))

From pipe:
0    140
1    108
2    150
Name: Shares, dtype: int64

end result:
 0    140.0
1    108.0
2    150.0
Name: Shares, dtype: float64

## Performing Analysis

In [34]:
display(stocks)

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

### High Level Summary of Data

In [35]:
display(stocks.info())
display(stocks.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Symbol  3 non-null      object
 1   Shares  3 non-null      int64
 2   Low     3 non-null      int64
 3   High    3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

None

          Shares         Low         High
count   3.000000    3.000000     3.000000
mean   32.666667  418.333333   565.000000
std    21.939310  419.295043   498.422512
min     8.000000  135.000000   170.000000
25%    24.000000  177.500000   285.000000
50%    40.000000  220.000000   400.000000
75%    45.000000  560.000000   762.500000
max    50.000000  900.000000  1125.000000

### Get n largest and smallest values

In [36]:
display(stocks.nlargest(2, "Shares"))
display(stocks.nsmallest(2, "Shares"))

  Symbol  Shares  Low  High
2   TSLA      50  220   400
0   AAPL      40  135   170

  Symbol  Shares  Low  High
1   AMZN       8  900  1125
0   AAPL      40  135   170

### Sorting

In [37]:
display(stocks)

# sort single conlumn
display(stocks.sort_values('Shares', ascending=True))

# sort multiple conlumns
# High will be treated as the tie breaker
display(stocks.sort_values(['Low', 'High'], ascending=True))

display(stocks)

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

  Symbol  Shares  Low  High
1   AMZN       8  900  1125
0   AAPL      40  135   170
2   TSLA      50  220   400

  Symbol  Shares  Low  High
0   AAPL      40  135   170
2   TSLA      50  220   400
1   AMZN       8  900  1125

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

### Drop Duplicates

In [38]:
series_with_dupes = pd.Series([3,54,7653,23,7653, 3])
display(series_with_dupes)

display(series_with_dupes.drop_duplicates())

0       3
1      54
2    7653
3      23
4    7653
5       3
dtype: int64

0       3
1      54
2    7653
3      23
dtype: int64

### String operations

In [39]:
ser = pd.Series(['test', 'lol', 'omg', 'test_1', 23])
display(ser)

display(ser.str.replace('test', 'tst'))
display(ser.str.extract(r"([^0-9.])"))

0      test
1       lol
2       omg
3    test_1
4        23
dtype: object

0      tst
1      lol
2      omg
3    tst_1
4      NaN
dtype: object

     0
0    t
1    l
2    o
3    t
4  NaN

### Binning 
https://pbpython.com/pandas-qcut-cut.html
    
When dealing with continuous numeric data, it is often helpful to bin the data into multiple buckets for further analysis. There are several different terms for binning including bucketing, discrete binning, discretization or quantization. Pandas supports these approaches using the `cut` and `qcut` functions.

We can use `cut` to cut into equal-width bins, or bin widths that we specify. `qcut` (quantile cut) will cut the entries into bins with the same size. 

#### qcut

The pandas documentation describes qcut as a “Quantile-based discretization function.” This basically means that __`qcut` tries to divide up the underlying data into equal sized bins__. The function defines the bins using percentiles based on the distribution of the data, not the actual numeric edges of the bins.

In [40]:
df = pd.DataFrame({'nums': np.arange(12)})
display(df)

# Because we asked for quantiles with q=4 the bins match the percentiles from the describe function.
display(df.describe())

#  create 4 equal sized groupings of the data
display(pd.qcut(df['nums'], q=4))

df['quantiles (qcut)'] = pd.qcut(df['nums'], q=4)

# adding labels to the buckets
df['quantile_labels (qcut)'] = pd.qcut(df['nums'], q=4, labels=['25', '50', '75', '100'])

display(df['quantiles (qcut)'].value_counts())
display(df)

    nums
0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11

            nums
count  12.000000
mean    5.500000
std     3.605551
min     0.000000
25%     2.750000
50%     5.500000
75%     8.250000
max    11.000000

0     (-0.001, 2.75]
1     (-0.001, 2.75]
2     (-0.001, 2.75]
3        (2.75, 5.5]
4        (2.75, 5.5]
5        (2.75, 5.5]
6        (5.5, 8.25]
7        (5.5, 8.25]
8        (5.5, 8.25]
9       (8.25, 11.0]
10      (8.25, 11.0]
11      (8.25, 11.0]
Name: nums, dtype: category
Categories (4, interval[float64]): [(-0.001, 2.75] < (2.75, 5.5] < (5.5, 8.25] < (8.25, 11.0]]

(8.25, 11.0]      3
(5.5, 8.25]       3
(2.75, 5.5]       3
(-0.001, 2.75]    3
Name: quantiles (qcut), dtype: int64

    nums quantiles (qcut) quantile_labels (qcut)
0      0   (-0.001, 2.75]                     25
1      1   (-0.001, 2.75]                     25
2      2   (-0.001, 2.75]                     25
3      3      (2.75, 5.5]                     50
4      4      (2.75, 5.5]                     50
5      5      (2.75, 5.5]                     50
6      6      (5.5, 8.25]                     75
7      7      (5.5, 8.25]                     75
8      8      (5.5, 8.25]                     75
9      9     (8.25, 11.0]                    100
10    10     (8.25, 11.0]                    100
11    11     (8.25, 11.0]                    100

#### cut

`cut` is used to specifically define the bin edges. There is no guarantee about the distribution of items in each bin. In fact, you can define bins in such a way that no items are included in a bin or nearly all items are in a single bin.

In [41]:
display(df)

df['cut'] = pd.cut(df['nums'], bins=[0, 5, 10, 15])
display(df)

    nums quantiles (qcut) quantile_labels (qcut)
0      0   (-0.001, 2.75]                     25
1      1   (-0.001, 2.75]                     25
2      2   (-0.001, 2.75]                     25
3      3      (2.75, 5.5]                     50
4      4      (2.75, 5.5]                     50
5      5      (2.75, 5.5]                     50
6      6      (5.5, 8.25]                     75
7      7      (5.5, 8.25]                     75
8      8      (5.5, 8.25]                     75
9      9     (8.25, 11.0]                    100
10    10     (8.25, 11.0]                    100
11    11     (8.25, 11.0]                    100

    nums quantiles (qcut) quantile_labels (qcut)           cut
0      0   (-0.001, 2.75]                     25           NaN
1      1   (-0.001, 2.75]                     25    (0.0, 5.0]
2      2   (-0.001, 2.75]                     25    (0.0, 5.0]
3      3      (2.75, 5.5]                     50    (0.0, 5.0]
4      4      (2.75, 5.5]                     50    (0.0, 5.0]
5      5      (2.75, 5.5]                     50    (0.0, 5.0]
6      6      (5.5, 8.25]                     75   (5.0, 10.0]
7      7      (5.5, 8.25]                     75   (5.0, 10.0]
8      8      (5.5, 8.25]                     75   (5.0, 10.0]
9      9     (8.25, 11.0]                    100   (5.0, 10.0]
10    10     (8.25, 11.0]                    100   (5.0, 10.0]
11    11     (8.25, 11.0]                    100  (10.0, 15.0]

### Filtering

Use operators like `>` or methods like `.gt()`

In [42]:
display(stocks)

bool_series = stocks['Low']>150
display(type(bool_series))
display(bool_series)

# sum up True values
display(bool_series.sum())  

# mean() = % of True values
display(stocks['Low'].dropna().gt(150).mean())
display((stocks['Low'] <= stocks['High']).mean())

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

pandas.core.series.Series

0    False
1     True
2     True
Name: Low, dtype: bool

2

0.6666666666666666

1.0

#### Boolean Operators and Conditionals

All values in a Series can be compared against a scalar value using the standard _comparison operators_ - `<, >, ==, !=, <=, and >=`.


The _comparison operators_ have a higher precedence than `and, or, xor and not`. However, the operators that pandas uses (the bitwise operators `&, |, ^ and ~`) have a higher precedence than the _comparison operators_.

In [43]:
display(stocks)

display((stocks.Low < 500) & (stocks.High < 500))

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

0     True
1    False
2     True
dtype: bool

#### Filtering with boolean arrays

Both Series and DataFrame can be filtered with Boolean arrays. You can index this directly off of the object or off of the .loc attribute.

In [44]:
stocks_with_symbol_index = stocks.set_index('Symbol')

display(stocks)
display(stocks_with_symbol_index)

criteria_1 = stocks_with_symbol_index.Shares > 30
criteria_2 = stocks_with_symbol_index.Low < 150

final_criteria = criteria_1 & criteria_2

display(type(final_criteria))
# Note the Symbol in the series
display(final_criteria)

display(stocks_with_symbol_index[final_criteria])
display(stocks_with_symbol_index.loc[final_criteria])

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

        Shares  Low  High
Symbol
AAPL        40  135   170
AMZN         8  900  1125
TSLA        50  220   400

pandas.core.series.Series

Symbol
AAPL     True
AMZN    False
TSLA    False
dtype: bool

        Shares  Low  High
Symbol
AAPL        40  135   170

        Shares  Low  High
Symbol
AAPL        40  135   170

#### isin

Whether each element in the DataFrame is contained in values.

In [45]:
display(stocks)
display(stocks.Symbol.isin(['AMZN', 'TSLA']))
display(stocks[stocks.Symbol.isin(['AMZN', 'TSLA'])])

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

0    False
1     True
2     True
Name: Symbol, dtype: bool

  Symbol  Shares  Low  High
1   AMZN       8  900  1125
2   TSLA      50  220   400

#### query
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.query.html

In [46]:
display(stocks)

stocks_to_select = ['AMZN', 'TSLA']
query = 'Symbol in @stocks_to_select and Low > 500'

display(stocks.query(query))

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

  Symbol  Shares  Low  High
1   AMZN       8  900  1125

#### Other useful methods

1. `where` - https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.where.html
2. `.clip` - https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.clip.html
3. `.clip_lower` and `.clip_upper`
4. `.mask` - https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.mask.html

### Grouping

The result of calling the `.groupby` method is a `groupby` object. It is this groupby object that will be the engine that drives all the calculations for this entire chapter. pandas does very little when creating this groupby object, merely validating that grouping is possible. You will have to chain methods on this groupby object to unleash its powers.

In addition to the grouping columns defined during the introduction, most aggregations have two other components, the aggregating columns and aggregating functions. The aggregating columns are the columns whose values will be aggregated. The aggregating functions define what aggregations take place. Aggregation functions include `sum, min, max, mean, count, variance, std`, and so on.

In [47]:
flights = pd.read_csv('data/flights.csv')
display(flights)

,MONTH,DAY,WEEKDAY,AIRLINE,ORG_AIR,DEST_AIR,SCHED_DEP,DEP_DELAY,AIR_TIME,DIST,SCHED_ARR,ARR_DELAY,DIVERTED,CANCELLED
0,1,1,4,WN,LAX,SLC,1625,58.0,94.0,590,1905,65.0,0,0
1,1,1,4,UA,DEN,IAD,823,7.0,154.0,1452,1333,-13.0,0,0
2,1,1,4,MQ,DFW,VPS,1305,36.0,85.0,641,1453,35.0,0,0
3,1,1,4,AA,DFW,DCA,1555,7.0,126.0,1192,1935,-7.0,0,0
4,1,1,4,WN,LAX,MCI,1720,48.0,166.0,1363,2225,39.0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
58487,12,31,4,AA,SFO,DFW,515,5.0,166.0,1464,1045,-19.0,0,0
58488,12,31,4,F9,LAS,SFO,1910,13.0,71.0,414,2050,4.0,0,0
58489,12,31,4,OO,SFO,SBA,1846,-6.0,46.0,262,1956,-5.0,0,0
58490,12,31,4,WN,MSP,ATL,525,39.0,124.0,907,855,34.0,0,0
58491,12,31,4,OO,SFO,BOI,859,5.0,73.0,522,1146,-1.0,0,0

In [48]:
# Define the grouping columns (AIRLINE), aggregating columns (ARR_DELAY), and aggregating functions (mean). 
# Place the grouping column in the .groupby method and then call the .agg method with a dictionary pairing the aggregating column with its aggregating function.
groupByObj = flights.groupby('AIRLINE')
display(type(groupByObj))
display(groupByObj.agg({'ARR_DELAY':'mean'}))

# another way of finding average delay by airline
display(flights
        .groupby('AIRLINE')
        ['ARR_DELAY']
        .agg('mean')) # You can pass any aggregating function directly to the .agg method, such as the NumPy mean function.

# another way of finding average delay by airline
display(flights
        .groupby('AIRLINE')
        ['ARR_DELAY']
        .mean())

pandas.core.groupby.generic.DataFrameGroupBy

         ARR_DELAY
AIRLINE
AA        5.542661
AS       -0.833333
B6        8.692593
DL        0.339691
EV        7.034580
F9       13.630651
HA        4.972973
MQ        6.860591
NK       18.436070
OO        7.593463
UA        7.765755
US        1.681105
VX        5.348884
WN        6.397353

AIRLINE
AA     5.542661
AS    -0.833333
B6     8.692593
DL     0.339691
EV     7.034580
F9    13.630651
HA     4.972973
MQ     6.860591
NK    18.436070
OO     7.593463
UA     7.765755
US     1.681105
VX     5.348884
WN     6.397353
Name: ARR_DELAY, dtype: float64

AIRLINE
AA     5.542661
AS    -0.833333
B6     8.692593
DL     0.339691
EV     7.034580
F9    13.630651
HA     4.972973
MQ     6.860591
NK    18.436070
OO     7.593463
UA     7.765755
US     1.681105
VX     5.348884
WN     6.397353
Name: ARR_DELAY, dtype: float64

#### Grouping and aggregating with multiple columns and functions

In [49]:
# Finding the number of canceled flights for every airline per weekday

display(flights.groupby(by=['AIRLINE', 'WEEKDAY'])
       ['CANCELLED']
       .sum())

AIRLINE  WEEKDAY
AA       1          41
         2           9
         3          16
         4          20
         5          18
                    ..
WN       3          18
         4          10
         5           7
         6          10
         7           7
Name: CANCELLED, Length: 98, dtype: int64

In [50]:
# Finding the number and percentage of canceled and diverted flights for every airline per weekday

display(flights.groupby(['AIRLINE', 'WEEKDAY'])
       [['CANCELLED', 'DIVERTED']]
       .agg(['sum', 'mean']))

                CANCELLED           DIVERTED
                      sum      mean      sum      mean
AIRLINE WEEKDAY
AA      1              41  0.032106        6  0.004699
        2               9  0.007341        2  0.001631
        3              16  0.011949        2  0.001494
        4              20  0.015004        5  0.003751
        5              18  0.014151        1  0.000786
...                   ...       ...      ...       ...
WN      3              18  0.014118        2  0.001569
        4              10  0.007911        4  0.003165
        5               7  0.005828        0  0.000000
        6              10  0.010132        3  0.003040
        7               7  0.006066        3  0.002600

[98 rows x 4 columns]

In [51]:
# For each origin and destination, finding the total number of flights, the number and percentage of canceled flights, 
# and the average and variance of the airtime

display(flights.groupby(['ORG_AIR', 'DEST_AIR'])
        .agg({'CANCELLED':['sum', 'mean', 'size'],
              'AIR_TIME':['mean', 'var']}))

# named aggregation object that can create non-hierarchical columns
display(flights
  .groupby(['ORG_AIR', 'DEST_AIR'])
  .agg(sum_cancelled=pd.NamedAgg(column='CANCELLED', aggfunc='sum'),
       mean_cancelled=pd.NamedAgg(column='CANCELLED', aggfunc='mean'),
       size_cancelled=pd.NamedAgg(column='CANCELLED', aggfunc='size'),
       mean_air_time=pd.NamedAgg(column='AIR_TIME', aggfunc='mean'),
       var_air_time=pd.NamedAgg(column='AIR_TIME', aggfunc='var')))

                 CANCELLED                   AIR_TIME
                       sum      mean size        mean         var
ORG_AIR DEST_AIR
ATL     ABE              0  0.000000   31   96.387097   45.778495
        ABQ              0  0.000000   16  170.500000   87.866667
        ABY              0  0.000000   19   28.578947    6.590643
        ACY              0  0.000000    6   91.333333   11.466667
        AEX              0  0.000000   40   78.725000   47.332692
...                    ...       ...  ...         ...         ...
SFO     SNA              4  0.032787  122   64.059322   11.338331
        STL              0  0.000000   20  198.900000  101.042105
        SUN              0  0.000000   10   78.000000   25.777778
        TUS              0  0.000000   20  100.200000   35.221053
        XNA              0  0.000000    2  173.500000    0.500000

[1130 rows x 5 columns]

                  sum_cancelled  mean_cancelled  size_cancelled  \
ORG_AIR DEST_AIR
ATL     ABE                   0        0.000000              31
        ABQ                   0        0.000000              16
        ABY                   0        0.000000              19
        ACY                   0        0.000000               6
        AEX                   0        0.000000              40
...                         ...             ...             ...
SFO     SNA                   4        0.032787             122
        STL                   0        0.000000              20
        SUN                   0        0.000000              10
        TUS                   0        0.000000              20
        XNA                   0        0.000000               2

                  mean_air_time  var_air_time
ORG_AIR DEST_AIR
ATL     ABE           96.387097     45.778495
        ABQ          170.500000     87.866667
        ABY           28.578947      6.590643
        ACY           91.333333     11.466667
        AEX           78.725000     47.332692
...                         ...           ...
SFO     SNA           64.059322     11.338331
        STL          198.900000    101.042105
        SUN           78.000000     25.777778
        TUS          100.200000     35.221053
        XNA          173.500000      0.500000

[1130 rows x 5 columns]

#### Removing the MultiIndex after grouping

Inevitably, when using groupby, you will create a MultiIndex. MultiIndexes can happen in both the index and the columns. DataFrames with MultiIndexes are more difficult to navigate and occasionally have confusing column names as well.

In this recipe, we perform an aggregation with the .groupby method to create a DataFrame with a MultiIndex for the rows and columns. Then, we manipulate the index so that it has a single level and the column names are descriptive.

In [52]:
# Find the total and average miles flown, and the maximum and minimum 
# arrival delay for each airline for each weekday:

airline_info = (flights
    .groupby(['AIRLINE', 'WEEKDAY'])
    .agg({'DIST':[sum, np.mean],
          'ARR_DELAY':['min', 'max']}) 
    .astype(int)
)

display(airline_info)

                    DIST       ARR_DELAY
                     sum  mean       min  max
AIRLINE WEEKDAY
AA      1        1455386  1139       -60  551
        2        1358256  1107       -52  725
        3        1496665  1117       -45  473
        4        1452394  1089       -46  349
        5        1427749  1122       -41  732
...                  ...   ...       ...  ...
WN      3         997213   782       -38  262
        4        1024854   810       -52  284
        5         981036   816       -44  244
        6         823946   834       -41  290
        7         945679   819       -45  261

[98 rows x 4 columns]

Both the rows and columns are labeled by a MultiIndex with two levels. Let's squash both down to just a single level.

In [53]:
display(airline_info.columns)
display(airline_info.columns.get_level_values(0))
display(airline_info.columns.get_level_values(1))
display(airline_info.columns.to_flat_index())

airline_info_copy = airline_info.copy()
airline_info_copy.columns = ['_'.join(x) for x in airline_info_copy.columns.to_flat_index()]

display(airline_info_copy)

MultiIndex([(     'DIST',  'sum'),
            (     'DIST', 'mean'),
            ('ARR_DELAY',  'min'),
            ('ARR_DELAY',  'max')],
           )

Index(['DIST', 'DIST', 'ARR_DELAY', 'ARR_DELAY'], dtype='object')

Index(['sum', 'mean', 'min', 'max'], dtype='object')

Index([('DIST', 'sum'), ('DIST', 'mean'), ('ARR_DELAY', 'min'),
       ('ARR_DELAY', 'max')],
      dtype='object')

                 DIST_sum  DIST_mean  ARR_DELAY_min  ARR_DELAY_max
AIRLINE WEEKDAY
AA      1         1455386       1139            -60            551
        2         1358256       1107            -52            725
        3         1496665       1117            -45            473
        4         1452394       1089            -46            349
        5         1427749       1122            -41            732
...                   ...        ...            ...            ...
WN      3          997213        782            -38            262
        4         1024854        810            -52            284
        5          981036        816            -44            244
        6          823946        834            -41            290
        7          945679        819            -45            261

[98 rows x 4 columns]

In [54]:
# A quick way to get rid of the row MultiIndex is to use the .reset_index method
# make use of the .reset_index method to push both index levels into columns

display(airline_info_copy.reset_index()) # Note the airline column in result

   AIRLINE  WEEKDAY  DIST_sum  DIST_mean  ARR_DELAY_min  ARR_DELAY_max
0       AA        1   1455386       1139            -60            551
1       AA        2   1358256       1107            -52            725
2       AA        3   1496665       1117            -45            473
3       AA        4   1452394       1089            -46            349
4       AA        5   1427749       1122            -41            732
..     ...      ...       ...        ...            ...            ...
93      WN        3    997213        782            -38            262
94      WN        4   1024854        810            -52            284
95      WN        5    981036        816            -44            244
96      WN        6    823946        834            -41            290
97      WN        7    945679        819            -45            261

[98 rows x 6 columns]

#### Grouping with a custom aggregation function

In [55]:
college = pd.read_csv('data/college.csv')
display(college)

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
0,Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
1,University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
2,Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
3,University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
4,Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7530,SAE Institute of Technology San Francisco,Emeryville,CA,NaN,NaN,NaN,1,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,9500
7531,Rasmussen College - Overland Park,Overland Park,KS,NaN,NaN,NaN,1,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,21163
7532,National Personal Training Institute of Cleveland,Highland Heights,OH,NaN,NaN,NaN,1,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,6333
7533,Bay Area Medical Academy - San Jose Satellite ...,San Jose,CA,NaN,NaN,NaN,1,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,PrivacySuppressed
7534,Excel Learning Center-San Antonio South,San Antonio,TX,NaN,NaN,NaN,1,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,12125

In [56]:
# Find the maximum number of standard deviations from the mean that any single population value is per state.

# There is no predefined pandas function to calculate the maximum number of standard deviations away from the mean. We need to write our own function.

# custom agg. func
# s param = UGDS series 
# .agg method requires that we return a scalar from the function, or else an exception will be raised
def max_deviation(s):
    std_score = (s - s.mean()) / s.std()
    return std_score.abs().max()

college.groupby('STABBR')['UGDS'].agg(max_deviation).round(1)

STABBR
AK     2.6
AL     5.8
AR     6.3
AS     NaN
AZ     9.9
CA     6.1
CO     5.0
CT     5.6
DC     2.4
DE     3.5
FL     8.4
FM     NaN
GA     5.4
GU     1.0
HI     3.8
IA     6.5
ID     4.5
IL     7.3
IN     9.1
KS     4.9
KY     5.2
LA     6.5
MA     6.1
MD     5.3
ME     4.0
MH     NaN
MI     6.7
MN     7.8
MO     7.2
MP     NaN
MS     4.0
MT     3.9
NC     4.9
ND     3.5
NE     5.0
NH     5.3
NJ     7.1
NM     4.5
NV     4.7
NY     8.2
OH    10.3
OK     5.9
OR     5.3
PA    10.1
PR     6.0
PW     NaN
RI     2.9
SC     6.0
SD     4.2
TN     6.0
TX     7.7
UT     5.1
VA     7.0
VI     NaN
VT     3.8
WA     6.6
WI     5.8
WV     7.2
WY     2.8
Name: UGDS, dtype: float64

#### Customizing aggregating functions with *args and **kwargs

In [57]:
# parameterize both the lower and upper bounds dynamically
def pct_between(s, low, high):
    return s.between(low, high).mean() * 100

display(college
    .groupby(['STABBR', 'RELAFFIL'])
    ['UGDS'] 
 # pass two non-keyword arguments, 1_000 and 10_000, to the .agg method. pandas passes these two arguments respectively to the low and high parameters of pct_between
    .agg(pct_between, low=1_000, high=10_000)
    .round(1))

# add sum aggregation

# utilize Python's closure functionality
def between_n_m(n, m):
    def wrapper(ser):
        return pct_between(ser, n, m)
    wrapper.__name__ = f'between_{n}_{m}'
    return wrapper

display(college
    .groupby(['STABBR', 'RELAFFIL'])
    ['UGDS'] 
    .agg([between_n_m(1_000, 10_000), 'max', 'mean'])
    .round(1)
)

STABBR  RELAFFIL
AK      0           42.9
        1            0.0
AL      0           45.8
        1           37.5
AR      0           39.7
                    ...
WI      0           31.0
        1           44.0
WV      0           29.2
        1           37.5
WY      0           72.7
Name: UGDS, Length: 112, dtype: float64

                 between_1000_10000      max    mean
STABBR RELAFFIL
AK     0                       42.9  12865.0  3508.9
       1                        0.0    275.0   123.3
AL     0                       45.8  29851.0  3248.8
       1                       37.5   3033.0   979.7
AR     0                       39.7  21405.0  1793.7
...                             ...      ...     ...
WI     0                       31.0  29302.0  2879.1
       1                       44.0   8212.0  1716.2
WV     0                       29.2  44924.0  1873.9
       1                       37.5   1375.0   716.4
WY     0                       72.7   9910.0  2244.4

[112 rows x 3 columns]

### Equals

In [58]:
stocks.equals(stocks)

True

## Index Alignment

Whenever a Series or DataFrame operates with another Series or DataFrame, the indexes (both the row index and column index) of each object align first before any operation begins. This index alignment happens behind the scenes and can be very surprising for those new to pandas. __This alignment always creates a Cartesian product between the indexes unless the indexes are identical.__

A Cartesian product is a mathematical term that usually appears in set theory. A Cartesian product between two sets is all the combinations of pairs of both sets. For example, the 52 cards in a standard playing card deck represent a Cartesian product between the 13 ranks (A, 2, 3,…, Q, K) and the four suits.

Producing a Cartesian product isn't always the intended outcome, but it's essential to be aware of how and when it occurs so as to avoid unintended consequences. In this recipe, two Series with overlapping but non-identical indexes are added together, yielding a surprising result. We will also show what happens if they have the same index.

__Example #1__

```python
>>> s1 = pd.Series(index=list("aaab"), data=np.arange(4))
>>> s1
a    0
a    1
a    2
b    3
dtype: int64
>>> s2 = pd.Series(index=list("cababb"), data=np.arange(6))
>>> s2
c    0
a    1
b    2
a    3
b    4
b    5
dtype: int64
```

```python
>>> s1 + s2
a    1.0
a    3.0
a    2.0
a    4.0
a    3.0
a    5.0
b    5.0
b    7.0
b    8.0
c    NaN
dtype: float64
```

Each a label in s1 pairs up with each a label in s2. This pairing produces six a labels, three b labels, and one c label in the resulting Series. A Cartesian product happens between all identical index labels.

As the element with label c is unique to the Series s2, pandas defaults its value to missing, as there is no label for it to align to in s1. pandas defaults to a missing value whenever an index label is unique to one object. This has the unfortunate consequence of changing the data type of the Series to a float, whereas each Series had only integers as values. The type change occurred because NumPy's missing value object, np.nan, only exists for floats but not for integers. Series and DataFrame columns must have homogeneous numeric data types. Therefore, each value in the column was converted to a float. Changing types makes little difference for this small dataset, but for larger datasets, this can have a significant memory impact.

__Example #2__

The Cartesian product is __not created__ when the indexes are unique or contain both the same exact elements and elements in the same order. When the index values are unique or they are the same and have the same order, a Cartesian product is not created, and the indexes instead align by their position. Notice here that each element aligned exactly by position and that the data type remained an integer:

``` python
>>> s1 = pd.Series(index=list("aaabb"), data=np.arange(5))
>>> s2 = pd.Series(index=list("aaabb"), data=np.arange(5))
>>> s1 + s2
a    0
a    2
a    4
b    6
b    8
dtype: int64

```

## pandas profiling library

There is a third-party library, pandas Profiling (https://pandas-profiling.github.io/pandas-profiling/docs/), that creates reports for each column. These reports are similar to the output of the .describe method, but include plots and other descriptive statistics.

In [59]:
import pandas_profiling as pp

# pp.ProfileReport(stocks)

## Methods List

Overview of some useful methods:

__Index__: `s` = series, `df` = DataFrame

1. `df.mean(), df.std() and df.quantile()` - Get a statical summary of the data.
2. `df.select_dtypes("int64").describe()` - Describe all columns of data type `int64`. This can be useful to convert column to a smaller datatype after checking the max in the output for each column
3. `s/df.nunique()` - # of unique values
4. `df.head(), df.tail(), df.sample()` - Get some samples from DataSet
5. `pd.isna()` - Detect missing values for an array-like object.
6. `s.str.replace/split` - Replace and Split operations on Strings
7. [`df.agg`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.aggregate.html) - Aggregate using one or more operations over the specified axis.
8. [`s/df.cov`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.cov.html) - Compute pairwise covariance of columns, excluding NA/null values.
9. [`s/df.corr`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.cov.html) - Compute pairwise correlation of columns, excluding NA/null values.